FSI1/Fluid/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |

# Author1: Nithin Adidela, IIT Goa
# email: nithin.adiela.16003@iitgoa.ac.in

# Author2: Revanth Sharma Kollegala, IIT Goa
# email: revanth.sharma.16003@iitgoa.ac.in

# Author3: Y Sudhakar, IIT Goa
# email: sudhakar@iitgoa.ac.in

# Inspired by the contribution by Derek Risseeuw (TU Delft).
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    ddtSchemes
    {
        default backward;
    }

    gradSchemes
    {
        default Gauss linear;
    }

    divSchemes
    {
        default         none;
    	div(phi,U)      bounded Gauss linearUpwind limited;
        div((nuEff*dev2(T(grad(U))))) Gauss linear;
    }

    interpolationSchemes
    {
        default linear;
    }

    laplacianSchemes
    {
        default Gauss linear corrected;
    }

    snGradSchemes
    {
        default corrected;
    }

    wallDist
    {
        method meshWave;
    }

    fluxRequired
    {
        default no;
        p ;
        Phi ;
    }
